Revit 2024 API
StairsRun.ActualTreadsNumber Property
 The actual number of stairs treads in the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int ActualTreadsNumber { get; }
Visual Basic
Public ReadOnly Property ActualTreadsNumber As Integer
	Get
Visual C++
public:
property int ActualTreadsNumber {
	int get ();
}
Remarks
 This is a read-only value.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace